app/controllers/boards_controller.rb

  def index
    @boards = Board.all
---
SELECT `boards`.* FROM `boards`

  def create
    Board.create(board_params)
---
INSERT INTO `boards` (`author_name`, `title`, `body`, `created_at`, `updated_at`) VALUES ('加藤', 'モンスター', '', '2025-04-29 06:50:09.737699', '2025-04-29 06:50:09.737699')

  def show
    @board = Board.find(params[:id])
---
SELECT `boards`.* FROM `boards` WHERE `boards`.`id` = 12 LIMIT 1

  def edit
    @board = Board.find(params[:id])
---
SELECT `boards`.* FROM `boards` WHERE `boards`.`id` = 12 LIMIT 1

  def update
    board = Board.find(params[:id])
    board.update(board_params)
---
SELECT `boards`.* FROM `boards` WHERE `boards`.`id` = 12 LIMIT 1
UPDATE `boards` SET `boards`.`body` = 'ネイル行きたいから午後開けておいて\r\n\r\n\r\nがだ', `boards`.`updated_at` = '2025-04-29 07:20:17.076584' WHERE `boards`.`id` = 12